In [ ]:
# 7.1 Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [7]:
In [14]: float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [15]: float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [8]:
In [16]: float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
In [17]: string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [18]: string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [10]:
In [19]: string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [11]:
In [20]: float_data = pd.Series([1, 2, None], dtype='float64')

In [21]: float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [12]:
In [22]: float_data.isna()

0    False
1    False
2     True
dtype: bool

In [13]:
In [23]: data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [24]: data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
In [25]: data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
In [26]: data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
   ....:                      [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [27]: data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
In [28]: data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [17]:
In [29]: data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
In [30]: data[4] = np.nan

In [31]: data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
In [32]: data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
In [33]: df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [34]: df.iloc[:4, 1] = np.nan

In [35]: df.iloc[:2, 2] = np.nan

In [36]: df

          0         1         2
0 -1.311899       NaN       NaN
1  1.014724       NaN       NaN
2  1.027743       NaN  2.113892
3  0.393049       NaN -0.737826
4  0.559822  1.443602 -0.687774
5  0.237563  0.957542  0.075894
6  0.471754 -0.019602  3.632043

In [21]:
In [37]: df.dropna()

          0         1         2
4  0.559822  1.443602 -0.687774
5  0.237563  0.957542  0.075894
6  0.471754 -0.019602  3.632043

In [22]:
In [38]: df.dropna(thresh=2)

          0         1         2
2  1.027743       NaN  2.113892
3  0.393049       NaN -0.737826
4  0.559822  1.443602 -0.687774
5  0.237563  0.957542  0.075894
6  0.471754 -0.019602  3.632043

In [23]:
In [39]: df.fillna(0)

          0         1         2
0 -1.311899  0.000000  0.000000
1  1.014724  0.000000  0.000000
2  1.027743  0.000000  2.113892
3  0.393049  0.000000 -0.737826
4  0.559822  1.443602 -0.687774
5  0.237563  0.957542  0.075894
6  0.471754 -0.019602  3.632043

In [24]:
In [40]: df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.311899  0.500000  0.000000
1  1.014724  0.500000  0.000000
2  1.027743  0.500000  2.113892
3  0.393049  0.500000 -0.737826
4  0.559822  1.443602 -0.687774
5  0.237563  0.957542  0.075894
6  0.471754 -0.019602  3.632043

In [25]:
In [41]: df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [42]: df.iloc[2:, 1] = np.nan

In [43]: df.iloc[4:, 2] = np.nan

In [44]: df

          0         1         2
0 -1.348732 -1.712664  0.188597
1  0.267031  0.377382 -0.546273
2  1.680136       NaN  0.173562
3 -1.913155       NaN -0.793159
4  0.308773       NaN       NaN
5  0.499009       NaN       NaN

In [26]:
In [45]: df.fillna(method="ffill")

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_98992/3613593599.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0 -1.348732 -1.712664  0.188597
1  0.267031  0.377382 -0.546273
2  1.680136  0.377382  0.173562
3 -1.913155  0.377382 -0.793159
4  0.308773  0.377382 -0.793159
5  0.499009  0.377382 -0.793159

In [27]:
In [46]: df.fillna(method="ffill", limit=2)

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_98992/630807030.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)

          0         1         2
0 -1.348732 -1.712664  0.188597
1  0.267031  0.377382 -0.546273
2  1.680136  0.377382  0.173562
3 -1.913155  0.377382 -0.793159
4  0.308773       NaN -0.793159
5  0.499009       NaN -0.793159

In [28]:
In [47]: data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [48]: data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [ ]:
# 7.2 Data Transformation

In [29]:
In [49]: data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
   ....:                      "k2": [1, 1, 2, 3, 3, 4, 4]})

In [50]: data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
In [51]: data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
In [52]: data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
In [53]: data["v1"] = range(7)

In [54]: data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [33]:
In [55]: data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [34]:
In [56]: data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [35]:
In [57]: data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
   ....:                               "pastrami", "corned beef", "bacon",
   ....:                               "pastrami", "honey ham", "nova lox"],
   ....:                      "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [58]: data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [36]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [37]:
In [60]: data["animal"] = data["food"].map(meat_to_animal)

In [61]: data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [38]:
In [62]: def get_animal(x):
   ....:     return meat_to_animal[x]

In [63]: data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [39]:
In [64]: data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [65]: data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [40]:
In [66]: data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [41]:
In [67]: data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [42]:
In [68]: data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
In [69]: data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [44]:
In [70]: data = pd.DataFrame(np.arange(12).reshape((3, 4)),
   ....:                     index=["Ohio", "Colorado", "New York"],
   ....:                     columns=["one", "two", "three", "four"])

In [45]:
In [71]: def transform(x):
   ....:     return x[:4].upper()

In [72]: data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [46]:
In [73]: data.index = data.index.map(transform)

In [74]: data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [47]:
In [75]: data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [48]:
In [76]: data.rename(index={"OHIO": "INDIANA"},
   ....:             columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [49]:
In [77]: ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [50]:
In [78]: bins = [18, 25, 35, 60, 100]

In [79]: age_categories = pd.cut(ages, bins)

In [80]: age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [51]:
In [81]: age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [52]:
In [82]: age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [53]:
In [83]: age_categories.categories[0]

Interval(18, 25, closed='right')

In [54]:
In [84]: pd.value_counts(age_categories)

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_98992/918818084.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [55]:
In [85]: pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [56]:
In [86]: group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [87]: pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [57]:
In [88]: data = np.random.uniform(size=20)

In [89]: pd.cut(data, 4, precision=2)

[(0.26, 0.48], (0.026, 0.26], (0.48, 0.71], (0.26, 0.48], (0.71, 0.94], ..., (0.26, 0.48], (0.026, 0.26], (0.71, 0.94], (0.26, 0.48], (0.026, 0.26]]
Length: 20
Categories (4, interval[float64, right]): [(0.026, 0.26] < (0.26, 0.48] < (0.48, 0.71] < (0.71, 0.94]]

In [58]:
In [90]: data = np.random.standard_normal(1000)

In [91]: quartiles = pd.qcut(data, 4, precision=2)

In [92]: quartiles

[(-0.78, -0.0053], (-0.78, -0.0053], (-0.0053, 0.74], (-0.78, -0.0053], (-0.0053, 0.74], ..., (-0.78, -0.0053], (-3.4099999999999997, -0.78], (0.74, 2.95], (0.74, 2.95], (0.74, 2.95]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.4099999999999997, -0.78] < (-0.78, -0.0053] < (-0.0053, 0.74] < (0.74, 2.95]]

In [59]:
In [93]: pd.value_counts(quartiles)

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_98992/467165752.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.4099999999999997, -0.78]    250
(-0.78, -0.0053]                250
(-0.0053, 0.74]                 250
(0.74, 2.95]                    250
Name: count, dtype: int64

In [60]:
In [94]: pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.3979999999999997, -1.352]    100
(-1.352, -0.00525]               400
(-0.00525, 1.272]                400
(1.272, 2.952]                   100
Name: count, dtype: int64

In [61]:
In [95]: data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [96]: data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.047393     0.005484    -0.039797     0.014768
std       1.015143     1.025645     1.012218     1.019697
min      -3.776339    -3.953672    -3.286082    -2.968216
25%      -0.631746    -0.726908    -0.739693    -0.664960
50%       0.062868     0.046672    -0.019599     0.058798
75%       0.722841     0.712141     0.671373     0.703437
max       4.033569     3.833270     2.535380     4.416444

In [62]:
In [97]: col = data[2]

In [98]: col[col.abs() > 3]

20    -3.201053
29    -3.176794
41    -3.119289
873   -3.286082
Name: 2, dtype: float64

In [63]:
In [99]: data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
20   0.625119 -0.319986 -3.201053  0.544903
29  -0.728649  1.312080 -3.176794 -0.108536
41  -0.665100  0.509468 -3.119289  0.937156
92  -0.517251 -3.953672  0.406435  1.475657
122  1.566738 -3.031850  0.453801 -2.162739
150  0.033190 -3.322277 -0.147133 -0.014732
316 -3.271294 -1.059171 -0.185558  0.795428
318 -1.137690 -3.364160  1.177095  0.096910
333  1.911473 -1.517324  1.795060  4.416444
357  4.033569 -0.344986 -2.381562  0.761420
404 -3.737476  0.349192 -1.543792 -0.535249
683  0.437060 -3.864748  0.899639 -0.883026
685  3.548498  3.833270  1.003500 -1.380196
723  1.289699  0.538294  0.385102  3.219327
759 -3.776339  1.051994 -0.241298 -0.414660
861  1.199300 -0.069511 -0.206632  3.107786
873  0.987007  0.713647 -3.286082  1.523570

In [64]:
In [100]: data[data.abs() > 3] = np.sign(data) * 3

In [101]: data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.047596     0.007188    -0.039014     0.013025
std       1.003833     1.014443     1.009840     1.013553
min      -3.000000    -3.000000    -3.000000    -2.968216
25%      -0.631746    -0.726908    -0.739693    -0.664960
50%       0.062868     0.046672    -0.019599     0.058798
75%       0.722841     0.712141     0.671373     0.703437
max       3.000000     3.000000     2.535380     3.000000

In [65]:
In [102]: np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0  1.0  1.0  1.0
2 -1.0 -1.0  1.0 -1.0
3  1.0 -1.0  1.0 -1.0
4  1.0 -1.0  1.0 -1.0

In [66]:
In [103]: df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

In [104]: df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [67]:
In [105]: sampler = np.random.permutation(5)

In [106]: sampler

array([4, 2, 0, 3, 1])

In [68]:
In [107]: df.take(sampler)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13

In [69]:
In [108]: df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13

In [70]:
In [109]: column_sampler = np.random.permutation(7)

In [110]: column_sampler

array([2, 6, 3, 5, 4, 1, 0])

In [71]:
In [111]: df.take(column_sampler, axis="columns")

    2   6   3   5   4   1   0
0   2   6   3   5   4   1   0
1   9  13  10  12  11   8   7
2  16  20  17  19  18  15  14
3  23  27  24  26  25  22  21
4  30  34  31  33  32  29  28

In [72]:
In [112]: df.sample(n=3)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20

In [74]:
In [113]: choices = pd.Series([5, 7, -1, 6, 4])

In [114]: choices.sample(n=10, replace=True)

4    4
2   -1
1    7
1    7
1    7
1    7
1    7
0    5
1    7
4    4
dtype: int64

In [75]:
In [115]: df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
   .....:                    "data1": range(6)})

In [116]: df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [76]:
In [117]: pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [80]:
In [118]: dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)

In [119]: df_with_dummy = df[["data1"]].join(dummies)

In [120]: df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [82]:
In [121]: mnames = ["movie_id", "title", "genres"]

In [122]: movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
   .....:                        header=None, names=mnames, engine="python")

In [123]: movies[:10]

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

In [83]:
In [124]: dummies = movies["genres"].str.get_dummies("|")

In [125]: dummies.iloc[:10, :6]

NameError: name 'movies' is not defined

In [84]:
In [126]: movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [127]: movies_windic.iloc[0]

NameError: name 'movies' is not defined

In [85]:
In [128]: np.random.seed(12345) # to make the example repeatable

In [129]: values = np.random.uniform(size=10)

In [130]: values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [87]:
In [131]: bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [132]: pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [ ]:
# 7.3 Extension Data Types

In [88]:
In [133]: s = pd.Series([1, 2, 3, None])

In [134]: s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [89]:
In [135]: s.dtype

dtype('float64')

In [90]:
In [136]: s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())

In [137]: s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [91]:
In [138]: s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [92]:
In [139]: s.dtype

Int64Dtype()

In [93]:
In [140]: s[3]

In [94]:
In [141]: s[3] is pd.NA

True

In [95]:
In [142]: s = pd.Series([1, 2, 3, None], dtype="Int64")

In [96]:
In [143]: s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())

In [144]: s

0      one
1      two
2     <NA>
3    three
dtype: string

In [97]:
In [145]: df = pd.DataFrame({"A": [1, 2, None, 4],
   .....:                    "B": ["one", "two", "three", None],
   .....:                    "C": [False, None, False, True]})

In [146]: df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [98]:
In [147]: df["A"] = df["A"].astype("Int64")

In [148]: df["B"] = df["B"].astype("string")

In [149]: df["C"] = df["C"].astype("boolean")

In [150]: df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [ ]:
# 7.4 String Manipulation

In [99]:
In [151]: val = "a,b,  guido"

In [152]: val.split(",")

['a', 'b', '  guido']

In [100]:
In [153]: pieces = [x.strip() for x in val.split(",")]

In [154]: pieces

['a', 'b', 'guido']

In [101]:
In [155]: first, second, third = pieces

In [156]: first + "::" + second + "::" + third

'a::b::guido'

In [102]:
In [157]: "::".join(pieces)

'a::b::guido'

In [103]:
In [158]: "guido" in val

True

In [104]:
In [159]: val.index(",")

1

In [105]:
In [160]: val.find(":")

-1

In [106]:
In [161]: val.index(":")

ValueError: substring not found

In [107]:
In [162]: val.count(",")

2

In [108]:
In [163]: val.replace(",", "::")

'a::b::  guido'

In [109]:
In [164]: val.replace(",", "")

'ab  guido'

In [110]:
In [165]: import re

In [166]: text = "foo    bar\t baz  \tqux"

In [167]: re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [111]:
In [168]: regex = re.compile(r"\s+")

In [169]: regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [112]:
In [170]: regex.findall(text)

['    ', '\t ', '  \t']

In [113]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [114]:
In [172]: regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [115]:
In [173]: m = regex.search(text)

In [174]: m

In [116]:
In [175]: text[m.start():m.end()]

'dave@google.com'

In [117]:
In [176]: print(regex.match(text))

None

In [118]:
In [177]: print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [119]:
In [178]: pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [179]: regex = re.compile(pattern, flags=re.IGNORECASE)

In [120]:
In [180]: m = regex.match("wesm@bright.net")

In [181]: m.groups()

('wesm', 'bright', 'net')

In [121]:
In [182]: regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [122]:
In [183]: print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [123]:
In [184]: data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
   .....:         "Rob": "rob@gmail.com", "Wes": np.nan}

In [185]: data = pd.Series(data)

In [186]: data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [124]:
In [187]: data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [125]:
In [188]: data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [126]:
In [189]: data_as_string_ext = data.astype('string')

In [190]: data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [127]:
In [191]: data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [128]:
In [192]: pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [193]: data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [129]:
In [194]: matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]

In [195]: matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [130]:
In [196]: matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [131]:
In [197]: data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [132]:
In [198]: data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [ ]:
# 7.5 Categorical Data

In [133]:
In [199]: values = pd.Series(['apple', 'orange', 'apple',
   .....:                     'apple'] * 2)

In [200]: values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [134]:
In [201]: pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [135]:
In [202]: pd.value_counts(values)

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_98992/4213383984.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [136]:
In [203]: values = pd.Series([0, 1, 0, 0] * 2)

In [204]: dim = pd.Series(['apple', 'orange'])

In [205]: values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [137]:
In [206]: dim

0     apple
1    orange
dtype: object

In [138]:
In [207]: dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [139]:
In [208]: fruits = ['apple', 'orange', 'apple', 'apple'] * 2

In [209]: N = len(fruits)

In [210]: rng = np.random.default_rng(seed=12345)

In [211]: df = pd.DataFrame({'fruit': fruits,
   .....:                    'basket_id': np.arange(N),
   .....:                    'count': rng.integers(3, 15, size=N),
   .....:                    'weight': rng.uniform(0, 4, size=N)},
   .....:                   columns=['basket_id', 'fruit', 'count', 'weight'])

In [212]: df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [140]:
In [213]: fruit_cat = df['fruit'].astype('category')

In [214]: fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [141]:
In [215]: c = fruit_cat.array

In [216]: type(c)

pandas.core.arrays.categorical.Categorical

In [142]:
In [217]: c.categories

Index(['apple', 'orange'], dtype='object')

In [143]:
In [219]: dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [144]:
In [220]: df['fruit'] = df['fruit'].astype('category')

In [221]: df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [145]:
In [222]: my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])

In [223]: my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [146]:
In [224]: categories = ['foo', 'bar', 'baz']

In [225]: codes = [0, 1, 2, 0, 0, 1]

In [226]: my_cats_2 = pd.Categorical.from_codes(codes, categories)

In [227]: my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [147]:
In [228]: ordered_cat = pd.Categorical.from_codes(codes, categories,
   .....:                                         ordered=True)

In [229]: ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [148]:
In [230]: my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [149]:
In [231]: rng = np.random.default_rng(seed=12345)

In [232]: draws = rng.standard_normal(1000)

In [233]: draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [150]:
In [234]: bins = pd.qcut(draws, 4)

In [235]: bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [151]:
In [236]: bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])

In [237]: bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [152]:
In [238]: bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [153]:
In [239]: bins = pd.Series(bins, name='quartile')

In [240]: results = (pd.Series(draws)
   .....:            .groupby(bins)
   .....:            .agg(['count', 'min', 'max'])
   .....:            .reset_index())

In [241]: results

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_98992/4199444877.py:4: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(bins)

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [154]:
In [242]: results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [155]:
In [243]: N = 10_000_000

In [244]: labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [245]: categories = labels.astype('category')

In [156]:
In [246]: labels.memory_usage(deep=True)

520000132

In [157]:
In [247]: categories.memory_usage(deep=True)

10000512

In [158]:
In [248]: %time _ = labels.astype('category')

CPU times: user 256 ms, sys: 49.5 ms, total: 305 ms
Wall time: 317 ms

In [159]:
In [249]: %timeit labels.value_counts()

214 ms ± 1.39 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [160]:
In [250]: %timeit categories.value_counts()

31.3 ms ± 255 μs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [161]:
In [251]: s = pd.Series(['a', 'b', 'c', 'd'] * 2)

In [252]: cat_s = s.astype('category')

In [253]: cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [162]:
In [254]: cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [163]:
In [255]: cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [164]:
In [256]: actual_categories = ['a', 'b', 'c', 'd', 'e']

In [257]: cat_s2 = cat_s.cat.set_categories(actual_categories)

In [258]: cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [165]:
In [259]: cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [166]:
In [260]: cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [167]:
In [261]: cat_s3 = cat_s[cat_s.isin(['a', 'b'])]

In [262]: cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [168]:
In [263]: cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [169]:
In [264]: cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [170]:
In [265]: pd.get_dummies(cat_s, dtype=float)

     a    b    c    d
0  1.0  0.0  0.0  0.0
1  0.0  1.0  0.0  0.0
2  0.0  0.0  1.0  0.0
3  0.0  0.0  0.0  1.0
4  1.0  0.0  0.0  0.0
5  0.0  1.0  0.0  0.0
6  0.0  0.0  1.0  0.0
7  0.0  0.0  0.0  1.0